davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_display.cpp
    if (is_gray4) {
      workspace += (size_t)plane_pitch;
    }
    if (workspace > sizeof(s_boot_row)) {
      return false;
    }
    if (dc->color_scheme == OD_COLOR_SCHEME_BWRY) {
      white_byte = 0x55u;
    } else if (dc->color_scheme == OD_COLOR_SCHEME_BWGBRY) {
      white_byte = 0x11u;
    }

    dW  = text_width_px(domain_line, scale_text);
    nW  = text_width_px(name_line, scale_text);
    fwW = text_width_px(fw_line, scale_text);
    k1W = text_width_px(k1, scale_text);
    k2W = text_width_px(k2, scale_text);
    text_origin_x = qr_right ? pad : ((int)w - (int)avail_w) / 2;
    if (text_origin_x < pad) {
      text_origin_x = pad;
    }
    text_max_x = qr_right ? (qr_x - pad) : (int)w;
    domX  = text_origin_x + ((avail_w - (int)dW)  / 2);
    nameX = text_origin_x + ((avail_w - (int)nW)  / 2);
    fwX   = text_origin_x + ((avail_w - (int)fwW) / 2);
    k1X   = text_origin_x + ((avail_w - (int)k1W) / 2);
    k2X   = text_origin_x + ((avail_w - (int)k2W) / 2);
    if (domX < pad) {
      domX = pad;
    }
    if (nameX < pad) {
      nameX = pad;
    }
    if (fwX < pad) {
      fwX = pad;
    }
    if (k1X < pad) {
      k1X = pad;
    }
    if (k2X < pad) {
      k2X = pad;
    }

    const int render_passes = is_gray4 ? 2 : 1;
    for (int pass = 0; pass < render_passes; pass++) {
      bbepSetAddrWindow(&epd, 0, 0, (int)w, (int)h);
      bbepStartWrite(&epd, is_gray4 ? (pass == 0 ? PLANE_0 : PLANE_1)
                                    : boot_start_plane(dc->color_scheme));

      for (y = 0; y < (int)h; y++) {
        memset(s_boot_row, white_byte, (size_t)pitch);

        draw_text_row(s_boot_row, y, domX,  text_y,                      domain_line, scale_text, bits_per_pixel,
                      text_max_x);
        draw_text_row(s_boot_row, y, nameX, text_y + boot_line_step(scale_text), name_line, scale_text, bits_per_pixel,
                      text_max_x);
        draw_text_row(s_boot_row, y, fwX,   text_y + boot_line_step(scale_text) * 2, fw_line, scale_text, bits_per_pixel,
                      text_max_x);
        draw_text_row(s_boot_row, y, k1X,   text_y + boot_line_step(scale_text) * 3, k1, scale_text, bits_per_pixel,
                      text_max_x);
        draw_text_row(s_boot_row, y, k2X,   text_y + boot_line_step(scale_text) * 4, k2, scale_text, bits_per_pixel,
                      text_max_x);

        if (y >= qr_y && y < qr_y + qr_px) {
          int local_y = y - qr_y;
          int my = local_y / module_px;
          if (my < (int)qr_modules) {
            int qy_qr = my - 4;
            int mx;
            for (mx = 0; mx < (int)qr_modules; mx++) {
              int qx_qr = mx - 4;
              bool on = false;
              if (qx_qr >= 0 && qy_qr >= 0 && qx_qr < (int)qr_size && qy_qr < (int)qr_size) {
                on = qrcode_getModule(&qr, (uint8_t)qx_qr, (uint8_t)qy_qr);
              }
              if (!on) {
                continue;
              }
              {
                int px0 = qr_x + mx * module_px;
                int sx;
                for (sx = 0; sx < module_px; sx++) {
                  int px = px0 + sx;
                  if (px >= 0 && px < (int)w) {
                    set_pixel_row(s_boot_row, px, bits_per_pixel);
                  }
                }
              }
            }
          }
        }

        if (is_gray4) {
          uint8_t *plane_row = s_boot_row + pitch;
          make_gray4_plane_row(plane_row, s_boot_row, plane_pitch, w, pass);
          bbepWriteData(&epd, plane_row, plane_pitch);
        } else {
          bbepWriteData(&epd, s_boot_row, pitch);
        }
      }
    }
    if (is3clr) {
      bbepStartWrite(&epd, PLANE_1);
      for (y = 0; y < (int)h; y++) {
        memset(s_boot_row, 0x00u, (size_t)pitch);
        bbepWriteData(&epd, s_boot_row, pitch);
      }
    }
  }
  return true;
}

static bool wait_for_refresh(uint32_t timeout_ms)
{
  uint32_t elapsed = 0;
  bool saw_busy = false;
  while (elapsed < timeout_ms) {
    bool busy = bbepIsBusy(&s_epd);
    if (busy) {
      saw_busy = true;
    } else if (saw_busy) {
      return true;
    }
    sl_sleeptimer_delay_millisecond(50);
    elapsed += 50;
  }
  return saw_busy && !bbepIsBusy(&s_epd);
}

extern "C" void opendisplay_display_abort(void)
{
  if (s_active) {
    bbepSleep(&s_epd, DEEP_SLEEP);
  }
  display_power_set(false);
  s_active = false;
  s_total_bytes = 0;
  s_written_bytes = 0;
  s_dw_chunk_n = 0;
  s_dw_log_pct = 0;
  s_dw_trailing_ignores = 0;
  s_plane_size = 0;
  s_plane2_started = false;
  s_dw_compressed = false;
  s_dw_decompressed_total = 0;
}

static void dw_log_progress(void)
{
  if (s_total_bytes == 0u) {
    return;
  }
  uint8_t pct = (uint8_t)((100u * s_written_bytes) / s_total_bytes);
  if (pct >= s_dw_log_pct + 25u) {
    printf("[OD] dw data #%lu %lu/%lu B (%u%%)%s\r\n", (unsigned long)s_dw_chunk_n,
           (unsigned long)s_written_bytes, (unsigned long)s_total_bytes, (unsigned)pct,
           s_dw_compressed ? " zlib" : "");
    s_dw_log_pct = (pct / 25u) * 25u;
  }
}

static int dw_stream_raw_bytes(const uint8_t *payload, uint32_t payload_len)
{
  uint32_t remaining = (s_written_bytes < s_total_bytes) ? (s_total_bytes - s_written_bytes) : 0u;
  const bool bitplanes = s_plane_size != 0u;
  const uint8_t *p = payload;
  uint32_t left = payload_len;
  const uint32_t written_before = s_written_bytes;

  while (left > 0u && remaining > 0u) {
    uint32_t rem = remaining;
    uint32_t chunk = left;
    if (bitplanes && !s_plane2_started && s_plane_size > 0u) {
      uint32_t to_plane_end = s_plane_size - s_written_bytes;
      if (chunk > to_plane_end) {
        chunk = to_plane_end;
      }
    }
    if (chunk > rem) {
      chunk = rem;
    }
    if (chunk == 0u) {
      break;
    }
    bbepWriteData(&s_epd, (uint8_t *)(void *)p, (int)chunk);
    p += chunk;
    left -= chunk;
    s_written_bytes += chunk;
    remaining -= chunk;
    if (bitplanes && !s_plane2_started && s_plane_size > 0u && s_written_bytes >= s_plane_size) {
      bbepStartWrite(&s_epd, PLANE_1);
      s_plane2_started = true;
    }
  }

  if (s_written_bytes > written_before) {
    dw_log_progress();
  }
  return 0;
}

static bool direct_zlib_sink(void *, od_mut_span_t bytes)
{
  uint32_t before = s_written_bytes;
  if (dw_stream_raw_bytes(bytes.p, (uint32_t)bytes.n) != 0) {
    return false;
  }
  return s_written_bytes - before == (uint32_t)bytes.n
         && s_written_bytes <= s_dw_decompressed_total;
}

static bool zlib_stream_to_direct_write(const uint8_t *data, uint32_t len, bool final)
{
  od_mut_span_t scratch = od_mut_span_make(s_decompression_chunk,
                                           OPENDISPLAY_DECOMPRESSION_CHUNK_SIZE);
  od_zlib_pump_status_t status = od_zlib_pump_push(
    od_span_make(data, len), final, scratch, direct_zlib_sink, nullptr);
  if (status == OD_ZLIB_PUMP_ERROR) {
    printf("[OD] zlib error: %s\r\n", od_zlib_pump_error());
    return false;
  }
  return !final || (status == OD_ZLIB_PUMP_DONE
                    && s_written_bytes == s_dw_decompressed_total);
}

extern "C" void opendisplay_display_boot_apply(void)
{
  const struct DisplayConfig *d = display_cfg();
  int panel;
  if (s_boot_applied || d == nullptr) {
    return;
  }
  s_boot_applied = true;
  panel = opendisplay_map_epd(d->panel_ic_type);
  if (panel == EP_PANEL_UNDEFINED) {
    return;
  }
  memset(&s_epd, 0, sizeof(s_epd));
  display_power_set(true);
  if (bbepSetPanelType(&s_epd, panel) != BBEP_SUCCESS) {
    display_power_set(false);
    return;
  }
#if OD_CAP_DUAL_CS == 0
  if ((s_epd.iFlags & BBEP_SPLIT_BUFFER) != 0u) {
    display_power_set(false);
    return;
  }
#endif
  bbepSetRotation(&s_epd, (int)d->rotation * 90);
  bbepInitIO(&s_epd, d->dc_pin, d->reset_pin, d->busy_pin, d->cs_pin, d->data_pin, d->clk_pin, 0);
  od_bbep_wake(&s_epd);
  od_bbep_send_panel_init_full(&s_epd);
  if (!render_boot_screen(s_epd, opendisplay_get_global_config())) {
    bbepSleep(&s_epd, DEEP_SLEEP);
    display_power_set(false);
    return;
  }
  /* The class's refresh(mode, bWait=true) called bbepWaitBusy() itself after a successful
     * refresh; the bare function does not. Written out explicitly -- dropping it would let boot
     * proceed while the panel was still refreshing. */
  if (bbepRefresh(&s_epd, REFRESH_FULL) == BBEP_SUCCESS) {
    bbepWaitBusy(&s_epd);
  }
  bbepSleep(&s_epd, DEEP_SLEEP);
  display_power_set(false);
}

extern "C" int opendisplay_display_direct_write_start(const uint8_t *payload, uint16_t payload_len)
{
  s_dw_init_t0 = sl_sleeptimer_get_tick_count();
  printf("[OD] dw init begin\r\n");

  const struct DisplayConfig *d = display_cfg();
  if (d == nullptr) {
    printf("[OD] dw start err no display cfg\r\n");
    return -1;
  }
  dw_init_mark("after cfg");

  od_color_geometry_t geometry;
  od_color_status_t color_status =
    od_color_direct_geometry(d->color_scheme, d->pixel_width, d->pixel_height, &geometry);
  if (color_status != OD_COLOR_OK || geometry.layout == OD_COLOR_LAYOUT_SPLIT_HALVES) {
    printf("[OD] dw start err unsupported color geometry cs=%u status=%d layout=%d\r\n",
           (unsigned)d->color_scheme, (int)color_status,
           color_status == OD_COLOR_OK ? (int)geometry.layout : -1);
    return -2;
  }

